app/Controllers/Operateurs/AuthController.php

    public function verifier()
    {
        $identifiant = $this->request->getPost('identifiant');
        $motDePasse = $this->request->getPost('mot_de_passe');

        $model = new OperateurModel();
        $operateur = $model->where('identifiant', $identifiant)->first();
---
SELECT *
FROM `operateur`
WHERE `identifiant` = 'admin'
 LIMIT 1