app/Controllers/Operateurs/BaremeFraisController.php

SELECT *
FROM `type_operation`
WHERE `type_operation`.`id` = '1'
SELECT *
FROM `bareme_frais`
WHERE `type_operation_id` = '1'
ORDER BY `montant_min` ASC
---
    public function index($typeOperationId)
    {
        $typeModel = new TypeOperationModel();
        $baremeModel = new BaremeFraisModel();

        $type = $typeModel->find($typeOperationId);

        if (!$type) {
            return redirect()->to('/operateur/types-operation')->with('erreur', 'Type d\'opération introuvable.');
        }

        $data['type'] = $type;
        $data['baremes'] = $baremeModel->where('type_operation_id', $typeOperationId)
            ->orderBy('montant_min', 'ASC')
            ->findAll();