app/Controllers/Operateurs/ClientController.php

    public function index()
    {
        $model = new ClientModel();
        $recherche = $this->request->getGet('numero');

        if (!empty($recherche)) {
            $model->like('numero', $recherche);
        }

        $data['clients'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `client`
ORDER BY `id` DESC