app/Controllers/Operateurs/PrefixeController.php

    public function index()
    {
        $model = new PrefixeModel();
        $data['prefixes'] = $model->findAll();
---
SELECT *
FROM `prefixe`