app/Controllers/Operateurs/TypeOperationController.php

SELECT *
FROM `type_operation`
---
    public function index()
    {
        $model = new TypeOperationModel();
        $data['types'] = $model->findAll();