app/Controllers/Clients/AuthController.php

    public function verifier()
    {
        $numero = trim($this->request->getPost('numero'));

        if (!preg_match('/^[0-9]{10}$/', $numero)) {
            return redirect()->back()->with('erreur', 'Le numéro doit contenir exactement 10 chiffres');
        }

        $prefixeModel = new PrefixeModel();
        $clientModel = new ClientModel();

        $prefixe = substr($numero, 0, 3);
        $prefixeValide = $prefixeModel->where('prefixe', $prefixe)->first();

        if (!$prefixeValide) {
            return redirect()->back()->with('erreur', 'Numéro invalide, préfixe non reconnu');
        }

        $client = $clientModel->where('numero', $numero)->first();

        if (!$client) {
            $clientModel->insert(['numero' => $numero, 'solde' => 0]);
---
SELECT *
FROM `prefixe`
WHERE `prefixe` = '034'
 LIMIT 1
SELECT *
FROM `client`
WHERE `numero` = '0340206997'
 LIMIT 1
INSERT INTO `client` (`numero`, `solde`) VALUES ('0340206997', 0)