app/Controllers/Clients/DashboardController.php

SELECT *
FROM `client`
WHERE `client`.`id` = 3
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->find(session()->get('client_id'));